<script setup lang="ts">
import Nav from "../components/index/nav.vue"
import Footer from "../components/detail/footer.vue"
import Bg from "../static/detail/background.png"
import Price from "../static/detail/price.png"
import Head from "../static/detail/head.png"

</script>

<template>
  <Nav height="10%"/>
  <div class="content">

    <div class="function">
      <div class="block">
        <div class="convert">
          <van-image round width="3rem" height="3rem" :src="Head"/>
          <div style="line-height: 100%">
            <div style="font-size: 14px;font-weight: 600">奥特加上的佛</div>
            <div style="font-size: 12px;color: gray">在金禅完成了N次任务</div>
          </div>
        </div>
      </div>
      <div class="block">
        <div class="convert">
          <van-image round width="3rem" height="3rem" :src="Price"/>
          <div style="line-height: 100%">
            <div style="font-size: 14px;font-weight: 600;margin-bottom: 5px">佣金</div>
            <div style="font-size: 30px;color: white;">200分</div>
          </div>
        </div>
      </div>
    </div>

    <div class="text">
      <div class="title">#任务编号</div>
      <div class="esp-all">
        诗歌，是一种抒情言志的文学体裁。是用高度凝练的语言，生动形象地表达作者丰富情
        感，集中反映社会生活并具有一定节奏和韵律的文学体裁。
        《毛诗·大序》记载：“诗者，志之所之也。在心为志，发言为诗”。南宋严羽《沧浪诗话》云：“诗者，吟咏性情也”。只有一种用言语表达的艺术就是诗歌。
        中文名
        诗歌
        7 新诗分类
        8 五言绝句
      </div>
    </div>

    <div class="text">
      <div class="title">#完成条件</div>
      <div class="esp-all">
        歌，现代一般统称为诗歌。它按照一定的音节、韵律的要求，表现社会生活和人的精神世界。诗的起源可以追溯到上古。《诗经》是我国第一部诗歌总集，相传为孔子所整理，关于这个问题学术界尚有争论。
        ，后来荟为专集，名《蓬莱纪胜》。”
        起源
        编辑
        播报
        荷花
        荷花
        古时候，古代信息技术不发达，所以人们从这一个地区到那一个地区传递信息都非常不方便，于是他们将写好的诗编成歌，而诗歌就从人们的口中传递。诗歌起源于上古的社会生活，因劳动生产、两性相恋、原始宗教等而产生的一种有韵律、富有感情色彩的语言形式。《尚书·虞书》记载：“诗言志，歌咏言，声依永，律和声。”《礼记·乐记》记载：“诗，言其志也；歌，咏其声也；舞，动其容也；三者本于心，然后乐器从之。”早期，诗、歌与乐、舞是合为一体的。诗即歌词，在实际表演中总是配合音乐、舞蹈而歌唱，后来诗、歌、乐、舞各自发展，独立成体。以入乐与否，区分歌与诗，入乐为歌，不入乐为诗。诗从歌中分化而来，为语言艺术，而歌则是一种历史久远的音乐文学。《诗经》是入乐歌唱的，严格地说它是歌，正因为如此，《诗经》被学者称之为我国音乐文学成熟的标志。
        诗歌是最古老也是最具有文学特质的文学样式，它来源于上古时期的劳动号子（后发展为民歌）以及祭祀颂词。诗歌原是诗与歌的总称，诗和音乐、舞蹈结合在一起，统称为诗歌。中国诗歌具有悠久的历史和丰富的遗产，如，《诗经》《楚辞》和《汉乐府》以及无数诗人的作品。欧洲的诗歌，由古希腊的荷马、萨福和古罗马的维吉尔、贺拉斯等诗人开启创作之源。 [3]
        诗歌发展
        编辑
        播报
        《诗经》→ 《楚辞》→汉乐府诗→魏晋南北朝民歌（代表者：建安七子）→唐诗→宋词→元曲→明清诗歌→现代诗、新诗
        诗歌特点
        编辑
        播报
        诗歌饱含着作者的思想感情与丰富的想象，语言凝练而形象性强，具有鲜明的节奏，和谐的音韵，富于音乐美，语句一般分行排列，注重结构形式的美。
        我国现代诗人、文学评论家何其芳曾说：“诗是一种最集中地反映社会生活的文学样式，它饱含着丰富的想象和感情，常常以直接抒情的方式来表现，而且在精炼与和谐的程度上，特别是在节奏的鲜明上，它的语言有别于散文的语言。”这个定义性的说明，概括了诗歌的几个基本特点：第一，高度集中、概括地反映生活；第二，抒情言志，饱含丰富的思想感情；第三，丰富的想象、联想和幻想；第四，语言具有音乐美。
        它具有以下四个特点：(1)诗歌的内容是社会生活的最集中的反映。(2)诗歌有丰富的感情与想象。(3)诗歌的语言具有精练、形象、音调和谐、节奏鲜明等特点。(4)诗歌在形式上，不是以句子为单位，而是以行为单位，且分行主要根据节奏，而不是以意思为主。
        表现手法
        编辑
        播报
        诗歌的表现手法很多，我国最早流行而至今仍常使用的传统表现手法有“赋、比、兴”。《毛诗序》说：“故诗有六义焉：一曰风，二曰赋，三曰比，四曰兴，五曰雅，六曰颂。”其间有一个绝句叫：“三光日月星，四诗风雅颂”。这“六义”中，“风、雅、颂”是指《诗经》的诗篇种类，“赋、比、兴”就是诗中的表现手法。赋：是直接陈述事物的表现手法。宋代学者朱熹在《诗集传》的注释中说：“赋者，敷陈其事而直言之也。”如，《诗经》中的《葛覃》《芣苢》就是用的这种手法。比：是用比喻的方法描绘事物，表达思想感情。刘勰在《文心雕龙·比兴》中说：“且何谓为比也？盖写物以附意，扬言以切事者也。”朱熹说：“比者，以彼物比此物也。”如，《诗经》中的《螽斯》《硕鼠》等篇即用此法写成。兴：是托物起兴，即借某一事物开头来引起正题要描述的事物和表现思想感情的写法。唐代孔颖达在《毛诗正义》中说：“兴者，起也。取譬引类，起发己心，诗文诸举草木鸟兽以见意者，皆兴辞也。”朱熹更明确地指出：“兴者，先言他物以引起所咏之辞也。”如《诗经》中的《关雎》《桃夭》等篇就是用“兴”的表现手法。这三种表现手法，一直流传下来，常常综合运用，互相补充，对历代诗歌创作都有很大的影响。诗歌的表现手法是很多的，而且历代以来不断地发展创造，运用也灵活多变，夸张、复沓、重叠、跳跃等等，难以尽述。但是各种方法都离不开想象，丰富的想象既是诗歌的一大特点，也是诗歌最重要的一种表现手法。在诗歌中，还有一种重要的表现手法是象征。象征，简单说就是“以象征义”，但在现代诗歌中，象征则又表现为心灵的直接意象，这是应予注意的。用现代的观点来说，诗歌塑造形象的手法，主要的有三种：
        比拟
        刘勰在《文心雕龙》一书中说：比拟就是“或喻于声，或方于貌，或拟于心，或譬于事。”这些在我们前面列举的诗词中，便有许多例证。比拟中还有一种常用的手法，就是“拟人化”：以物拟人，或以人拟物。前者如徐志摩的《再别康桥》：轻轻的我走了，/正如我轻轻的来；/我轻轻的招手，/作别西天的云彩。/那河畔的金柳，/是夕阳中的新娘；/波光里的艳影，/在我的心头荡漾。把“云彩”“金柳”都当作人来看待。以人拟物的，如，洛夫的《因为风的缘故》：……我的心意/则明亮亦如你窗前的烛光/稍有暧昧之处/势所难免/因为风的缘故/……以整生的爱/点燃一盏灯/我是火/随时可能熄灭/因为风的缘故。把“我的心”比拟为烛光，把我比作灯火。当然，归根结底，实质还是“拟人”。
        夸张
        就是把所要描绘的事物放大，好像电影里的“大写”“特写”镜头，以引起读者的重视和联想。李白的“桃花潭水深千尺，不及汪伦送我情”（《赠汪伦》）“飞流直下三千尺，疑是银河落九天”（《望庐山瀑布》），其中说到“深千尺”“三千尺”，虽然并非事实真相，但他所塑造的形象，却生动地显示了事物的特征，表达了诗人的激情，读者不但能够接受，而且能信服，很惊喜。然而这种夸张，必须是艺术的、美的，不能过于荒诞，或太实、太俗。打油诗是市井文学的一种特殊形式。如，有一首描写棉花丰收的打油诗：“一朵棉花打个包/压得卡车头儿翘/头儿翘，三尺高/好像一门高射炮。”读后却反而使人觉得不真实，产生不出美的感觉。
        借代
        就是借此事物代替彼事物。它与比拟有相似之处，但又有所不同，不同之处在于：比拟一般是比的和被比的事物都是具体的、可见的；而借代却是一方具体，一方较为抽象，在具体与抽象之间架起桥梁，使诗歌的形象更为鲜明、突出，以引发读者的联想。这也就是艾青所说的“给思想以翅膀，给感情以衣裳，给声音以彩
      </div>
    </div>


    <div class="img">
      <VanImage width="100%" height="100%" :src="Bg"/>
    </div>

  </div>
  <Footer />
</template>

<style scoped lang="less">
.content {
  width: 100%;
  height: 75%;
  .function {
    width: 100%;
    height: 10%;
    margin: 10px auto;
    display: flex;
    justify-content: space-between;
    .block {
      width: 48%;
      height: 100%;
      border-radius: 10px;
      .convert {
        display: flex;
        justify-content: space-around;
        align-items: center;
        font-family: Adobe Heiti Std;
      }

    }
  }
  .text {
    height: 30%;
    .title {
      width: 8rem;
      height: 1.5rem;
      border-radius: 10px;
      border: 2px solid;
      font-size: 14px;
      font-weight: 600;
      text-align: start;
      padding-left: 15px;
      background-color: #FFFFFF;
    }
    .esp-all {
      display: -webkit-box;
      font-size: 14px;
      font-weight: 600;
      overflow: hidden;
      -webkit-line-clamp: 5;
      -webkit-box-orient: vertical;
    }
  }
  .img {
    height: 35%;
  }
}
</style>